```
Some useful infor:
  Pipe operator: %>%
  filter    -> selecting rows
  select    -> selecting cols
  mutate    -> add/change cols
  arrange   -> order rows
  summarize -> make summary
  group_by
  data pivoting: tydyr lib: pivot_longer (pivot in some languages) 
                            pivot_wider  (un-pivot in some languages)
  string manipulation: stringr lib
  Json parsing: jsonlite lib: toJSON() and fromJSON()
  Web scraping: rvest lib
```

In [1]:
library(dplyr)
library(data.table)

Warning message:
"package 'dplyr' was built under R version 3.6.3"
Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union


Attaching package: 'data.table'

The following objects are masked from 'package:dplyr':

    between, first, last

## I. Dataframe basics

In [2]:
df <- data.frame(label = c('a1', 'a2', 'a3', 'a4', 'a5'),
                 x1 = c(9, 2, 3, NA, NA), 
                 x2 = c(100, NA, 300, 400, NA))
df

  label x1 x2
1 a1     9 100
2 a2     2  NA
3 a3     3 300
4 a4    NA 400
5 a5    NA  NA

In [3]:
print(nrow(df))
print(ncol(df))
print(dim(df))
print(length(df))

[1] 5
[1] 3
[1] 5 3
[1] 3

In [4]:
dftest <- df[, !(colnames(df) %in% c('x1', 'x99'))]
dftest

  label x2
1 a1    100
2 a2     NA
3 a3    300
4 a4    400
5 a5     NA

### Access rows and columns

In [5]:
df[2, ]   # at row 2

  label x1 x2
2 a2    2  NA

In [6]:
df[c(1, 3), ] # at row 1, 3

  label x1 x2
1 a1    9  100
3 a3    3  300

In [7]:
df[1]  # at column 1

  label
1 a1
2 a2
3 a3
4 a4
5 a5

In [8]:
df['label']

  label
1 a1
2 a2
3 a3
4 a4
5 a5

### Get unique values of a column

In [9]:
labels = unique(df$label)
labels
class(labels)

[1] a1 a2 a3 a4 a5
Levels: a1 a2 a3 a4 a5

[1] "factor"

### Access df by column names

In [10]:
df_sub2 <- df[c('x1', 'x2')]
df_sub2

  x1 x2
1  9 100
2  2  NA
3  3 300
4 NA 400
5 NA  NA

In [11]:
df_sub1 <- df['x1']
df_sub1
class(df_sub1)

  x1
1  9
2  2
3  3
4 NA
5 NA

[1] "data.frame"

### Set index for df instead of integer index

In [12]:
df <- data.frame(label = c('a1', 'a2', 'a3', 'a4', 'a5'),
                 x1 = c(9, 2, 3, NA, NA), 
                 x2 = c(100, NA, 300, 400, NA))
df

  label x1 x2
1 a1     9 100
2 a2     2  NA
3 a3     3 300
4 a4    NA 400
5 a5    NA  NA

In [13]:
row.names(df) <- df[['label']]
df

   label x1 x2
a1 a1     9 100
a2 a2     2  NA
a3 a3     3 300
a4 a4    NA 400
a5 a5    NA  NA

In [14]:
colnames(df)

[1] "label" "x1"    "x2"

In [15]:
df <- df[, !(colnames(df) %in% c('label'))]
# Other way: df <- subset(df, select = -c(label))
df

   x1 x2
a1  9 100
a2  2  NA
a3  3 300
a4 NA 400
a5 NA  NA

In [16]:
row.names(df) <- df$label
df

  x1 x2
1  9 100
2  2  NA
3  3 300
4 NA 400
5 NA  NA

### select() columns

In [17]:
df %>% select(1:1) # 1:2

  x1
1  9
2  2
3  3
4 NA
5 NA

### Subset(): Remove a column in df

In [18]:
df <- data.frame(label = c('a1', 'a2', 'a3', 'a4', 'a5'),
                 x1 = c(9, 2, 3, NA, NA), 
                 x2 = c(100, NA, 300, 400, NA))

df_sub <- subset(df, select = -c(label, x1))
class(df_sub)
df_sub

[1] "data.frame"

  x2
1 100
2  NA
3 300
4 400
5  NA

### Sorted df by values in a colum: order and arrange

In [19]:
df <- data.frame(label = c('a1', 'a2', 'a3', 'a4', 'a5'),
                 x1 = c(9, 2, 3, NA, NA), 
                 x2 = c(100, NA, 300, 400, NA))
df

  label x1 x2
1 a1     9 100
2 a2     2  NA
3 a3     3 300
4 a4    NA 400
5 a5    NA  NA

In [20]:
df_sorted <- df[order(df$x1), ]  # Note: raise error if df has only x1 column
df_sorted

  label x1 x2
2 a2     2  NA
3 a3     3 300
1 a1     9 100
4 a4    NA 400
5 a5    NA  NA

In [21]:
df_arrange <- df %>% arrange(x1)
df_arrange

  label x1 x2
1 a2     2  NA
2 a3     3 300
3 a1     9 100
4 a4    NA 400
5 a5    NA  NA

In [22]:
df_arrange <- df %>% arrange(x1, desc(x2))
df_arrange

  label x1 x2
1 a2     2  NA
2 a3     3 300
3 a1     9 100
4 a4    NA 400
5 a5    NA  NA

#### How to arrange by colname value

In [23]:
colnames(df)
'x1' %in% colnames(df)

[1] "label" "x1"    "x2"

[1] TRUE

##### 'x1' NOT work correctly

In [24]:
df_arrange <- df %>% arrange('x1', desc(x2))  
df_arrange

  label x1 x2
1 a4    NA 400
2 a3     3 300
3 a1     9 100
4 a2     2  NA
5 a5    NA  NA

##### Solution 1

In [25]:
sort.by.column <- function(df, column.name) {
  df[order(df[, column.name]), ]
}    

df_arrange <- sort.by.column(df, 'x1')
df_arrange

  label x1 x2
2 a2     2  NA
3 a3     3 300
1 a1     9 100
4 a4    NA 400
5 a5    NA  NA

##### Solution 2

In [26]:
col <- sym('x1') 
col
class(col)

x1

[1] "name"

In [27]:
col <- sym('x1') 
df_arrange <- df %>% arrange(!!col) # if desc use arrange(desc(!!col))
df_arrange

  label x1 x2
1 a2     2  NA
2 a3     3 300
3 a1     9 100
4 a4    NA 400
5 a5    NA  NA

### remove "rows" in a dataframe with a NA value in one of the columns

In [28]:
df1 = na.omit(df)
df1

  label x1 x2
1 a1    9  100
3 a3    3  300

### remove "rows" in a dataframe with all NA

In [29]:
df <- data.frame(label = c('a1', 'a2', 'a3', 'a4', 'a5'),
                 x1 = c(9, 2, 3, NA, NA),                 
                 x2 = c(100, NA, 300, 400, NA))
row.names(df) <- df[['label']]
df <- subset(df, select = -c(label))
df

   x1 x2
a1  9 100
a2  2  NA
a3  3 300
a4 NA 400
a5 NA  NA

In [30]:
df_remove_row_all_NA <- filter_all(df, any_vars(!is.na(.)))
df_remove_row_all_NA

   x1 x2
a1  9 100
a2  2  NA
a3  3 300
a4 NA 400

### Get column names

In [31]:
# col_names = colnames(df)
col_names = names(df)
col_names
class(col_names)

[1] "x1" "x2"

[1] "character"

### Add a new column

In [32]:
df_small <- data.frame(value = c(1,4 ), name = c(1,NA))
df_small
as.numeric(rownames(df_small))

  value name
1 1      1
2 4     NA

[1] 1 2

In [33]:
# Add a new column directly
df_small$id <- as.numeric(rownames(df_small))
df_small

  value name id
1 1      1   1
2 4     NA   2

In [34]:
# Add a new column by cbind
df_small <- cbind(df_small, new_col = as.numeric(rownames(df_small))) 
df_small

  value name id new_col
1 1      1   1  1
2 4     NA   2  2

### Change a column to rownames

In [35]:
df <- data.frame(name = c('AA', 'BB'), value1 = c(1,4 ),  value2 = c(10, 3))
df

  name value1 value2
1 AA   1      10
2 BB   4       3

In [36]:
df <- data.frame(df, row.names = "name")
df

   value1 value2
AA 1      10
BB 4       3

### Create list of dataframe

In [37]:
df1 <- data.frame(value = c(1,4,3), name = c(1,1,1))
df2 <- data.frame(value = c(4,3,7), name = c(1,0,1))

# Explicit way to make a list of df
list_df <- list(df1, df2)
list_df

[[1]]
  value name
1     1    1
2     4    1
3     3    1

[[2]]
  value name
1     4    1
2     3    0
3     7    1

In [38]:
# Append() to make a list of df
vec = c()
print('df1')
vec <- append(vec, list(df1))
vec
print("df1 and df2")
vec <- append(vec, list(df2))
vec

[1] "df1"

[[1]]
  value name
1     1    1
2     4    1
3     3    1

[1] "df1 and df2"

[[1]]
  value name
1     1    1
2     4    1
3     3    1

[[2]]
  value name
1     4    1
2     3    0
3     7    1

In [39]:
# Concat list of df to be one df. rbind() require all df has the same column names
do.call("rbind", vec)

  value name
1 1     1
2 4     1
3 3     1
4 4     1
5 3     0
6 7     1

### get column names where it has less than 2 real values

In [40]:
len <- function(x) { return (length(x[!is.na(x)])) } 

df <- data.frame(value1 = c(4,3,7), value2 = c(NA, 0,NA), value3 = c(4,NA,7), value4=c(NA,NA,NA))
df

  value1 value2 value3 value4
1 4      NA      4     NA
2 3       0     NA     NA
3 7      NA      7     NA

In [41]:
vec_len_smaller_2 <- c()
for (col in colnames(df)){
    if (len(df[[col]]) < 2){
        vec_len_smaller_2 <- c(vec_len_smaller_2, col)
    }
}
vec_len_smaller_2

[1] "value2" "value4"

### Empty dataframe

In [42]:
df_empty <- data.frame()
dim(df_empty)
df_empty

[1] 0 0

In [43]:
# Make a function
empty_df <- function(columns){
  # Input:
  #   columns: a vector of column names
  # Output:
  # An empty dataframe
  # Usage:
  #   Eg1. Empty datafram with column names
  #        df_empty_1 <- empty_df(columns= c("id", "names", "address")) 
  #   Eg2. Empty datafram without any column. Same as df_empty_2 <- data.frame()
  #        df_empty_2 <- empty_df(columns= c()) 
  
  # pass this columns length to ncol parameter and nrow with 0
  df_empty = data.frame(matrix(nrow = 0, ncol = length(columns)))
  # assign column names
  colnames(df_empty) = columns
  return (df_empty)
}

df_empty_1 <- empty_df(columns= c("id", "names", "address")) 
dim(df_empty_1)
df_empty_1

[1] 0 3

     id names address

In [44]:
df_empty_2 <- empty_df(columns= c()) 
dim(df_empty_2)
df_empty_2

[1] 0 0

### rename column names

In [45]:
df1 <- data.frame(value = c(1, 4), name = c(1 , NA))
df1

  value name
1 1      1
2 4     NA

In [46]:
library(dplyr)

df1 %>% rename(new_value = value, new_name = name)

  new_value new_name
1 1          1
2 4         NA

### Calculate a new column by transform()

In [47]:
df1 <- data.frame(value1 = c(1, 2, 3), value2 = c(2, NA, 6))
df1

  value1 value2
1 1       2
2 2      NA
3 3       6

In [48]:
df1 <- transform(df1, value1_2 = value1 / value2, value2_1 = value2 / value1)
df1

  value1 value2 value1_2 value2_1
1 1       2     0.5       2
2 2      NA      NA      NA
3 3       6     0.5       2

### Reset index of df

In [49]:
df <- data.frame(Names=c('A', 'B', 'C'), Values=c(11, 12, 19))
print(df)
rownames(df)

  Names Values
1     A     11
2     B     12
3     C     19

[1] "1" "2" "3"

In [50]:
rownames(df) <- c(99, 10, 5)
print(df)

   Names Values
99     A     11
10     B     12
5      C     19

In [51]:
df <- df %>% as.data.frame(row.names = 1:nrow(.))
print(df)

  Names Values
1     A     11
2     B     12
3     C     19

In [52]:
# make rownames as NULL
rownames(df) <- NULL
df

  Names Values
1 A     11
2 B     12
3 C     19

### Rank

In [53]:
df <- data.frame(Names=c('A', 'B', 'C', 'D', 'E'), Values=c(-19, 100, 12, -19, -100))
df

  Names Values
1 A      -19
2 B      100
3 C       12
4 D      -19
5 E     -100

In [54]:
df <- cbind(Rank = rank(df$Values), df)
df

  Rank Names Values
1 2.5  A      -19
2 5.0  B      100
3 4.0  C       12
4 2.5  D      -19
5 1.0  E     -100

In [55]:
df <- cbind(RankDesc = rank(-df$Values), df)
df

  RankDesc Rank Names Values
1 3.5      2.5  A      -19
2 1.0      5.0  B      100
3 2.0      4.0  C       12
4 3.5      2.5  D      -19
5 5.0      1.0  E     -100

### rbindlist(): concatenate list of dataframes    
at library(data.table)
https://www.rdocumentation.org/packages/data.table/versions/1.14.0/topics/rbindlist

In [56]:
# default case
DT1 = data.table(A=1:3,B=letters[1:3])
DT2 = data.table(A=4:5,B=letters[4:5])
DT1
DT2
l = list(DT1,DT2)
rbindlist(l)

  A B
1 1 a
2 2 b
3 3 c

  A B
1 4 d
2 5 e

  A B
1 1 a
2 2 b
3 3 c
4 4 d
5 5 e

In [57]:
DT1 = data.table(A=1:3,B=letters[1:3])
DT2 = data.table(B=letters[4:5],A=4:5)
DT1
DT2
l = list(DT1,DT2)
rbindlist(l, use.names=TRUE)

  A B
1 1 a
2 2 b
3 3 c

  B A
1 d 4
2 e 5

  A B
1 1 a
2 2 b
3 3 c
4 4 d
5 5 e

In [58]:
# fill missing columns, and match by col names
DT1 = data.table(A=1:3,B=letters[1:3])
DT2 = data.table(B=letters[4:5],C=factor(1:2))
DT1
DT2
l = list(DT1,DT2)
rbindlist(l, use.names=TRUE, fill=TRUE)

  A B
1 1 a
2 2 b
3 3 c

  B C
1 d 1
2 e 2

  A  B C
1  1 a NA
2  2 b NA
3  3 c NA
4 NA d 1
5 NA e 2

In [59]:
# generate index column, auto generates indices
rbindlist(l, use.names=TRUE, fill=TRUE, idcol=TRUE)

  .id A  B C
1 1    1 a NA
2 1    2 b NA
3 1    3 c NA
4 2   NA d 1
5 2   NA e 2

In [60]:
# let's name the list
setattr(l, 'names', c("a", "b"))
rbindlist(l, use.names=TRUE, fill=TRUE, idcol="ID")

  ID A  B C
1 a   1 a NA
2 a   2 b NA
3 a   3 c NA
4 b  NA d 1
5 b  NA e 2

## II. Transform multi-level JSON to Dataframe

### 1. Make a raw json string for testing

In [61]:
library(jsonlite)

json_str <- '{
    "_id" : "AAA1",
    "individualCode" : "HBD001",
    "Samples" : [ 
        {
            "filename" : "PBMCs_APC HBD001 ACD-A 17apr18_088․fcs",
            "project" : "CPI",
            "markers" : [ 
                {
                    "name" : "NK (%LC)",
                    "value" : 17.92,
                    "confidence" : "",
                    "interpretation" : ""
                }, 
                {
                    "name" : "NK- 1 (%LC)",
                    "value" : 1.35,
                    "confidence" : "",
                    "interpretation" : ""
                }              
            ]
        }, 
        {
            "filename" : "PBMCs_Th cell HBD001 ACD-A 18apr18_045․fcs",
            "project" : "CPI",
            "markers" : [ 
                {
                    "name" : "Exhausted (%CD4)",
                    "value" : 0.29,
                    "confidence" : "",
                    "interpretation" : ""
                }, 
                {
                    "name" : "R5 Th1 (%CD4)",
                    "value" : 1.23,
                    "confidence" : "",
                    "interpretation" : ""
                }
            ]
        }
    ]
}'

json_str

[1] "{\n    \"_id\" : \"AAA1\",\n    \"individualCode\" : \"HBD001\",\n    \"Samples\" : [ \n        {\n            \"filename\" : \"PBMCs_APC HBD001 ACD-A 17apr18_088·fcs\",\n            \"project\" : \"CPI\",\n            \"markers\" : [ \n                {\n                    \"name\" : \"NK (%LC)\",\n                    \"value\" : 17.92,\n                    \"confidence\" : \"\",\n                    \"interpretation\" : \"\"\n                }, \n                {\n                    \"name\" : \"NK- 1 (%LC)\",\n                    \"value\" : 1.35,\n                    \"confidence\" : \"\",\n                    \"interpretation\" : \"\"\n                }              \n            ]\n        }, \n        {\n            \"filename\" : \"PBMCs_Th cell HBD001 ACD-A 18apr18_045·fcs\",\n            \"project\" : \"CPI\",\n            \"markers\" : [ \n                {\n                    \"name\" : \"Exhausted (%CD4)\",\n                    \"value\" : 0.29,\n                    \"confidence\" : \"\",\n                    \"interpretation\" : \"\"\n                }, \n                {\n                    \"name\" : \"R5 Th1 (%CD4)\",\n                    \"value\" : 1.23,\n                    \"confidence\" : \"\",\n                    \"interpretation\" : \"\"\n                }\n            ]\n        }\n    ]\n}"

### 2. Convert json string to R object

In [62]:
list_json <- fromJSON(json_str)
list_json

$`_id`
[1] "AAA1"

$individualCode
[1] "HBD001"

$Samples
                                    filename project
1     PBMCs_APC HBD001 ACD-A 17apr18_088·fcs     CPI
2 PBMCs_Th cell HBD001 ACD-A 18apr18_045·fcs     CPI
                                              markers
1          NK (%LC), NK- 1 (%LC), 17.92, 1.35, , , ,
2 Exhausted (%CD4), R5 Th1 (%CD4), 0.29, 1.23, , , ,

### 3. Convert R list object to DataFrame

In [63]:
df <- do.call("cbind", list_json)
df

  _id  individualCode Samples.filename
1 AAA1 HBD001         PBMCs_APC HBD001 ACD-A 17apr18_088·fcs
2 AAA1 HBD001         PBMCs_Th cell HBD001 ACD-A 18apr18_045·fcs
  Samples.project
1 CPI
2 CPI
  Samples.markers
1 NK (%LC)   , NK- 1 (%LC), 17.92      , 1.35       ,            ,            ,            ,
2 Exhausted (%CD4), R5 Th1 (%CD4)   , 0.29            , 1.23            ,                 ,                 ,                 ,

### 4.  DataFrame of markers (Optional)

In [64]:
# Check
list_markers <- df$Samples.markers
list_markers

[[1]]
         name value confidence interpretation
1    NK (%LC) 17.92
2 NK- 1 (%LC)  1.35

[[2]]
              name value confidence interpretation
1 Exhausted (%CD4)  0.29
2    R5 Th1 (%CD4)  1.23

In [65]:
library(data.table)

df_markers <- rbindlist(list_markers, fill=TRUE)
df_markers

  name             value confidence interpretation
1 NK (%LC)         17.92
2 NK- 1 (%LC)       1.35
3 Exhausted (%CD4)  0.29
4 R5 Th1 (%CD4)     1.23

In [66]:
# at df_markers: change column name to HBD001
colnames(df_markers)[colnames(df_markers) == 'value'] <- 'HBD001'
df_markers

  name             HBD001 confidence interpretation
1 NK (%LC)         17.92
2 NK- 1 (%LC)       1.35
3 Exhausted (%CD4)  0.29
4 R5 Th1 (%CD4)     1.23

### Create a function

In [67]:
transform_df <- function(df, newColname){
    list_Samples <- df$Samples
    df_Samples <- rbindlist(list_Samples, fill=TRUE)
    list_markers <- df_Samples$markers
    df_markers <- rbindlist(list_markers, fill=TRUE)
    colnames(df_markers)[colnames(df_markers) == 'value'] <- newColname
    return (df_markers)
}

## III. Merge two Dataframes  
```
cbind() – combining the columns of two data frames side-by-side
rbind() – stacking two data frames on top of each other, appending one to the other
merge() – joining two data frames using a common column
```

### 1. Merge

In [68]:
df_authors <- data.frame(
    surname = c("AA", "BB", "EE"),
    nationality = c("US", "Australia", "US"),
    retired = c("yes", rep("no", 2)))
df_authors

  surname nationality retired
1 AA      US          yes
2 BB      Australia   no
3 EE      US          no

In [69]:
df_books <- data.frame(
    name = c("AA", "DD", "BB"),
    title = c("Title1", NA, "Title3"))
df_books

  name title
1 AA   Title1
2 DD   NA
3 BB   Title3

In [70]:
df_merge <- merge(x=df_authors, 
                  y=df_books, 
                  by.x="surname", 
                  by.y="name",
                  all=TRUE  # ALL: Outer Join, all.x= TRUE: Left Join, all.y=TRUE: Right join, No specify: Inner join
                            # NOTE: Cross join: merge(x = df1, y = df2, by = NULL)
                 )
df_merge

  surname nationality retired title
1 AA      US          yes     Title1
2 BB      Australia   no      Title3
3 EE      US          no      NA
4 DD      NA          NA      NA

### 2. rbind and bind_rows

In [71]:
df1 <- data.frame(a=c(0,1,2), b=c(3,4,5), c=c(6,7,8))
df1

  a b c
1 0 3 6
2 1 4 7
3 2 5 8

In [72]:
df2 <- data.frame(a=c(9,10), c=c(12,13))
df2

  a  c
1  9 12
2 10 13

In [73]:
df2$b <- NA  # make a new column with all NA
df2

  a  c  b
1  9 12 NA
2 10 13 NA

In [74]:
rbind(df1, df2)   # rbind() requires df1, df2 have the same columns

  a  b  c
1  0  3  6
2  1  4  7
3  2  5  8
4  9 NA 12
5 10 NA 13

In [75]:
df3 <- data.frame(a=c(9,10), c=c(12,13))
df3

  a  c
1  9 12
2 10 13

In [76]:
bind_rows(df1, df3)  # from the dplyr library. 
                     # Don't need the same column names at both df

  a  b  c
1  0  3  6
2  1  4  7
3  2  5  8
4  9 NA 12
5 10 NA 13

## IV. filter dataframe

#### Postive number

In [77]:
df1 <- data.frame(a = c(0,-10,2), b = c(3, NA, 5), c = c(6, NA, 9))
df1

  a   b  c
1   0  3  6
2 -10 NA NA
3   2  5  9

In [78]:
df1 %>% filter(a > 0)

  a b c
1 2 5 9

In [79]:
df1 %>% filter(a == 2 & c == 9)

  a b c
1 2 5 9

In [80]:
df1 %>% filter(a == 2 & c == 100)

     a b c

In [81]:
df1 %>% filter(b > 0)  #filter >0 also remove NA

  a b c
1 0 3 6
2 2 5 9

#### Remove NA

In [82]:
df1 %>% filter(!is.na(b))

  a b c
1 0 3 6
2 2 5 9

#### Others

In [83]:
library(dplyr)

df <- cbind(expand.grid(sciName=list("A", "B", "C"), family=list("X", "Y"), stage=list("S1", "S2", "S3", "S4")), count=1)
df

   sciName family stage count
1  A       X      S1    1
2  B       X      S1    1
3  C       X      S1    1
4  A       Y      S1    1
5  B       Y      S1    1
6  C       Y      S1    1
7  A       X      S2    1
8  B       X      S2    1
9  C       X      S2    1
10 A       Y      S2    1
11 B       Y      S2    1
12 C       Y      S2    1
13 A       X      S3    1
14 B       X      S3    1
15 C       X      S3    1
16 A       Y      S3    1
17 B       Y      S3    1
18 C       Y      S3    1
19 A       X      S4    1
20 B       X      S4    1
21 C       X      S4    1
22 A       Y      S4    1
23 B       Y      S4    1
24 C       Y      S4    1

In [84]:
# set up our filter conditions
condition1 <- list(sciName="A", stageVector=c("S2", "S3"))
condition2 <- list(sciName="C", stageVector=c("S3", "S4"))
conditionList <- list(condition1, condition2)
conditionList

[[1]]
[[1]]$sciName
[1] "A"

[[1]]$stageVector
[1] "S2" "S3"


[[2]]
[[2]]$sciName
[1] "C"

[[2]]$stageVector
[1] "S3" "S4"

In [85]:
# Define the filtering function
filterStages <- function(condition, df) {
    subset.data <- df %>%
        filter(sciName == condition$sciName) %>%
        filter(stage %in% condition$stageVector)
    return(subset.data)
}

In [86]:
# demo the filter function working on a single condition at a time
filterStages(condition1, df)
filterStages(condition2, df)

  sciName family stage count
1 A       X      S2    1
2 A       Y      S2    1
3 A       X      S3    1
4 A       Y      S3    1

  sciName family stage count
1 C       X      S3    1
2 C       Y      S3    1
3 C       X      S4    1
4 C       Y      S4    1

In [87]:
# demo the filter function working over a list of conditions
resultDataList <- lapply(conditionList, filterStages, df)
resultDataList

[[1]]
  sciName family stage count
1       A      X    S2     1
2       A      Y    S2     1
3       A      X    S3     1
4       A      Y    S3     1

[[2]]
  sciName family stage count
1       C      X    S3     1
2       C      Y    S3     1
3       C      X    S4     1
4       C      Y    S4     1

## V. Aggregate df

In [88]:
df <- data.frame(Company = c('A', 'A', 'B', 'C', 'A', 'B', 'B', 'C', 'C'), 
                 Name = c("Wayne", "Wayne", "William", "Rafael", "John", "Eric", "James", "Pablo", "Tammy"), 
                 Age = c(26, 27, 28, 32, 28, 24, 34, 30, 25), 
                 Wages = c(50000, 70000, 70000, 60000, 50000, 70000, 65000, 50000, 50000), 
                 Education.University = c(1, 1, 1, 0, 0, 1, 1, 0, 1), 
                 Productivity = c(100, 120, 120, 95, 88, 115, 100, 90, 120))
df

  Company Name    Age Wages Education.University Productivity
1 A       Wayne   26  50000 1                    100
2 A       Wayne   27  70000 1                    120
3 B       William 28  70000 1                    120
4 C       Rafael  32  60000 0                     95
5 A       John    28  50000 0                     88
6 B       Eric    24  70000 1                    115
7 B       James   34  65000 1                    100
8 C       Pablo   30  50000 0                     90
9 C       Tammy   25  50000 1                    120

### group_by and summarise

In [89]:
df_summary <- df %>% 
                group_by(Company) %>% 
                summarise(Age = mean(Age), 
                          Wages = mean(Wages), 
                          Education.University = sum(Education.University), 
                          Productivity = mean(Productivity))
df_summary

  Company Age      Wages    Education.University Productivity
1 A       27.00000 56666.67 2                    102.6667
2 B       28.66667 68333.33 3                    111.6667
3 C       29.00000 53333.33 1                    101.6667

### group_by_at, vars and summarise

In [90]:
df_summary_1 <- df %>%
                group_by_at(vars(one_of(c("Company", "Name")))) %>%
                summarize(Age = mean(Age))
df_summary_1

`summarise()` has grouped output by 'Company'. You can override using the `.groups` argument.

  Company Name    Age
1 A       John    28.0
2 A       Wayne   26.5
3 B       Eric    24.0
4 B       James   34.0
5 B       William 28.0
6 C       Pablo   30.0
7 C       Rafael  32.0
8 C       Tammy   25.0

### Aggregate

In [91]:
aggregate(x = df[c("Age","Wages","Education.University","Productivity")], 
          by = df[c("Company", "Name")], 
          FUN = mean)

  Company Name    Age  Wages Education.University Productivity
1 B       Eric    24.0 70000 1                    115
2 B       James   34.0 65000 1                    100
3 A       John    28.0 50000 0                     88
4 C       Pablo   30.0 50000 0                     90
5 C       Rafael  32.0 60000 0                     95
6 C       Tammy   25.0 50000 1                    120
7 A       Wayne   26.5 60000 1                    110
8 B       William 28.0 70000 1                    120

## VI. Pivot and Transpose dataframe

In [92]:
# install.packages("tidyverse")
# library(tidyverse)

In [93]:
available.packages()["tidyr",]
package_version(R.version)
# print(sessionInfo())
# print(version)

                                                                                                                                              Package
                                                                                                                                              "tidyr"
                                                                                                                                              Version
                                                                                                                                              "1.2.0"
                                                                                                                                             Priority
                                                                                                                                                   NA
                                                                                                                                              Depends
                                                                                                                                         "R (>= 3.1)"
                                                                                                                                              Imports
"dplyr (>= 1.0.0), ellipsis (>= 0.1.0), glue, lifecycle,\nmagrittr, purrr, rlang, tibble (>= 2.1.1), tidyselect (>=\n1.1.0), utils, vctrs (>= 0.3.7)"
                                                                                                                                            LinkingTo
                                                                                                                                   "cpp11 (>= 0.4.0)"
                                                                                                                                             Suggests
                                                  "covr, data.table, jsonlite, knitr, readr, repurrrsive (>=\n1.0.0), rmarkdown, testthat (>= 3.0.0)"
                                                                                                                                             Enhances
                                                                                                                                                   NA
                                                                                                                                              License
                                                                                                                                 "MIT + file LICENSE"
                                                                                                                                      License_is_FOSS
                                                                                                                                                   NA
                                                                                                                                License_restricts_use
                                                                                                                                                   NA
                                                                                                                                              OS_type
                                                                                                                                                   NA
                                                                                                                                                Archs
                                                                                                                                                   NA
                                                                                                                                               MD5sum
                                                                                                                   "232638248d7f3d4458548c95da96f28b"
                                                                                                                                     NeedsCompilation
                                                                                                                                                "yes"
                                                                                                                                                 File
                                                                                                                                                   NA
                                                                                                                                           Repository
                                                                                                             "https://cran.r-project.org/src/contrib"

[1] '3.6.1'

In [94]:
# install.packages("tidyr")
library(tidyr)
library(dplyr)

Warning message:
"package 'tidyr' was built under R version 3.6.3"

In [95]:
NUM <- c("45", "45", "45", "45", "48", "50", "66", "66", "66", "68")
Type <- c("A", "F", "C", "B", "D", "A", "E", "C", "F", "D")
Points <- c(9.2,60.8,22.9,1012.7,18.7,11.1,67.2,63.1,16.7,58.4)
df <- data.frame(NUM, Type, Points)
df

   NUM Type Points
1  45  A       9.2
2  45  F      60.8
3  45  C      22.9
4  45  B    1012.7
5  48  D      18.7
6  50  A      11.1
7  66  E      67.2
8  66  C      63.1
9  66  F      16.7
10 68  D      58.4

### pivot_wider() function

In [96]:
df %>%
    pivot_wider(names_from = Type, values_from = Points)

  NUM A    F    C    B      D    E
1 45   9.2 60.8 22.9 1012.7   NA   NA
2 48    NA   NA   NA     NA 18.7   NA
3 50  11.1   NA   NA     NA   NA   NA
4 66    NA 16.7 63.1     NA   NA 67.2
5 68    NA   NA   NA     NA 58.4   NA

### Transpose df

In [97]:
data <- read.table(text="X Y    Z
                   ID12   2012-06    566
                   ID1    2012-06  10239
                   ID6    2012-06    524
                   ID12   2012-07   2360
                   ID1    2012-07   13853
                   ID6    2012-07    2352
                   ID12   2012-08   3950
                   ID1    2012-08   14738
                   ID6    2012-08   4104",header=TRUE)
rownames(data)
colnames(data)
data

[1] "1" "2" "3" "4" "5" "6" "7" "8" "9"

[1] "X" "Y" "Z"

  X    Y       Z
1 ID12 2012-06   566
2 ID1  2012-06 10239
3 ID6  2012-06   524
4 ID12 2012-07  2360
5 ID1  2012-07 13853
6 ID6  2012-07  2352
7 ID12 2012-08  3950
8 ID1  2012-08 14738
9 ID6  2012-08  4104

In [98]:
data[c("Y", "Z")]

  Y       Z
1 2012-06   566
2 2012-06 10239
3 2012-06   524
4 2012-07  2360
5 2012-07 13853
6 2012-07  2352
7 2012-08  3950
8 2012-08 14738
9 2012-08  4104

In [99]:
transpose(data, fill=NA, ignore.empty=FALSE, keep.names="marker", make.names="X")

ERROR: Error in transpose(data, fill = NA, ignore.empty = FALSE, keep.names = "marker", : unused arguments (keep.names = "marker", make.names = "X")

# VI. Percentile

### Percentile example

```
Note: method == 'Pandas' is equivalent to the below code.
    Just difference with JCSMR in pct_increment = 1. / length instead of  1. / (length + 1)
    length = len([v for v in df['Values'] if not nan_none_empty_str(v)])
    pct_increment = 1. / length
    df['Rank_Percentile_Manual'] = df.Rank * pct_increment
Eg. df = pd.DataFrame({'Values': [119, np.nan, 80, 50, 120, 90, 119]}).sort_values('Values')
    # Output below is rank max for ties: df['Rank'] = df.rank(method='max')  # average, min, max
        Values	Rank	Rank_Percentile_Pandas	Rank_Percentile_Manual	Rank_Percentile_JCSMR
    0	50.0	1.0	            0.166667	            0.166667	        0.142857
    1	80.0	2.0	            0.333333	            0.333333	        0.285714
    2	90.0	3.0	            0.500000	            0.500000	        0.428571
    3	119.0	5.0	            0.833333	            0.833333	        0.714286
    4	119.0	5.0	            0.833333	            0.833333	        0.714286
    5	120.0	6.0	            1.000000	            1.000000	        0.857143
    6	NaN	   NaN	            NaN	                    NaN	                NaN
```

In [ ]:
# Calculate percentile of a value w.r.t a vector
percentile_norm <- function(value, vec, method='JCSMR'){
   # method == 'JCSMR' or a normal way
   if (method == 'JCSMR'){
       epsilon <- 1e-6
       maxVal <- max(vec, na.rm = TRUE)
       vec <- c(vec, maxVal + epsilon)
   }   
   return (ecdf(vec)(value))   
} 

vec <- c(50, 80, 90, 119, 119, 120, NA)
# min(vec, na.rm = TRUE) # max(vec, na.rm = TRUE)
lapply(c(50, 80, 90, 119, 119, 120, NA), percentile_norm, vec)

In [ ]:
# Calculate percentile of a value w.r.t a vector
percentile_norm <- function(value, vec, method='JCSMR'){
   # method == 'JCSMR' or a normal way
   if (method == 'JCSMR'){
       epsilon <- 1e-6
       maxVal <- max(vec, na.rm = TRUE)
       vec <- c(vec, maxVal + epsilon)
   }   
   return (ecdf(vec)(value))   
} 

# df_data: At "Single Cells/Single Cells/live/LC and Mono/LC/non BT/CD15neg/NK 1 | Freqâ€¤ of LC"
#          has many values 0.33, 0.97, 0.41, 0.31, 2.15, 1.21, 0.64, 0.7, 1.09, 0.93, 
#                          0.85, 1.82, 0.93, 6.35, 0.68

# df_control: at "Single Cells/Single Cells/live/LC and Mono/LC/non BT/CD15neg/NK 1 | Freqâ€¤ of LC"
#             Only HBD063 has value =0.9 others are NA

vec <- c(NA, 0.9, NA)  # control data
lapply(c(0.33, 0.97, 0.41, 0.31, 2.15, 1.21, 0.64, 0.7, 1.09, 0.93, 0.85, 1.82, 0.93, 6.35, 0.68), # real data
       percentile_norm, 
       vec  # # control data
      )

In [ ]:
# df_test <- data.frame(Values = c(50, 80, 90, 119, 119, 120, NA))
# df_test.percentile <- df_test %>% 
#     mutate(Rank = rank(Values, na.last = 'keep', ties.method = c("average")))  %>% # NA rank last
#     # rank(x, na.last = TRUE,
#     # ties.method = c("average", "first", "last", "random", "max", "min"))

#     # (rank of row in its partition - 1) / (number of rows in the partition - 1)
#     mutate(Rank_Percentile = percent_rank(Values)) %>%
#     mutate(Rank_Percentile_manual = percent_rank(Rank)) %>%
#     mutate(PCT_wo_ties = ntile(Values, 100)) %>% # # percentiles
#     mutate(Rank_Percentile_JCSMR = rank(Values, na.last = 'keep', ties.method = c("average")) * (1. / (len(df_control$Values) + 1))) 
#     # mutate(PCT = ntile(Values, 4)) # quartiles 
#     # mutate(PCT = ntile(Values, 10))  # deciles
# df_test.percentile

## Control data

In [ ]:
Values <- c(50, 80, 90, 119, 119, 120, NA)
Comment <- rep('Control', length(Values))
df_control <- data.frame(Comment, 
                         Values,
                         Values1 = Values,
                         Not_existed_in_df_data = Values
                        )
#df_control
summary(df_control)

In [ ]:
# df_control.per <- df_control %>% 
#     mutate(Rank = rank(Values, na.last = 'keep', ties.method = c("average")))  %>% # NA rank last
#     mutate(Rank_Percentile_JCSMR = per_JCSMR(df_control$Values)) 
# df_control.per

## real data

In [ ]:
Values <- c(40, 50, 100, 119, 120, NA, 150) 
Comment <- rep('Data', length(Values))
df_data <- data.frame(Comment, 
                      Values,
                      Values1 = Values,
                      Values_new_1 = Values,
                      Values_new_2 = Values
                     )
df_data
summary(df_data)

In [ ]:
len <- function(x) { return (length(x[!is.na(x)])) } 

percentile_JCSMR <- function(vec){
    percentiles <- rank(vec, na.last = 'keep', ties.method = c("average")) * (1. / (len(vec) + 1))
    return (percentiles)
}

percentile <- function(vec){
    percentiles <- rank(vec, na.last = 'keep', ties.method = c("average")) * (1. / len(vec))
    return (percentiles)    
}

# Calculate percentile of a value w.r.t a vector
percentile_norm <- function(value, vec){
  return (ecdf(vec)(value))
} 


# normalize percentile one column
norm_perc_one_col <- function(col_name, df_control, df_data){
    df_data[[col_name]] <- unlist(lapply(df_data[, col_name], percentile_norm, df_control[, col_name]))
    return (df_data)
}


normalize_percentile <- function(df_control, df_data, col_not_cal_per="marker"){
    
    # columns existed both in df_control and df_data
    common_cols <- intersect(names(df_control), names(df_data))
    
    # Get column to calculate normalized percentile (w.r.t control data) 
    selected_cols <- common_cols[common_cols != col_not_cal_per]
    for (col_name in selected_cols){
        df_data[[col_name]] <- unlist(lapply(df_data[, col_name], percentile_norm, df_control[, col_name]))
    }
    
    # columns existed df_data ONLY. Calculate percentile by itself
    cols_in_data_only <- setdiff(names(df_data), names(df_control))
    for (col_name in cols_in_data_only){
        # df_data[[col_name]] <- per_JCSMR(df_data[, col_name])
        df_data[[col_name]] <- percentile(df_data[, col_name])
    }
    
    return (list(df=df_data, cols_in_data_only=cols_in_data_only))  
}

df_data <- normalize_percentile(df_control, df_data)
df_data
df_data$df
df_data$cols_in_data_only

In [ ]:
sort_a_marker <- function(df, selected_marker, asc=TRUE, keep_all_cols=TRUE){
   # To sort a marker in asc or desc order
   # Input
   # df: a dataframe in a standard format. 
   #     Eg. Ref. get_standard_df_control(), get_standard_df_data()
   # selected_marker: a column name in a string format
   # asc: sort marker as asc order if TRUE, else desc
   #      Default: TRUE
   # keep_all_cols: keep all "marker" columns if TRUE, else get ONLY selected_marker column
   #                Default: TRUE
   # Ouput: a new dataframe
   #
   # Usage:
   # df = studyCode	marker1	 marker2
   #       CPI515	      0.3	  0.6
   #       CPI248	      NA	     0.1
   #       CPI270	      0.2	  0.3
   #       CPI280	      0.4	  0.4
   #       CPI282	      0.1	  0.3
   # df_sorted = sort_a_marker(df, selected_marker='marker1', asc=TRUE, keep_all_cols=TRUE)
   # df_sorted =
   #      studyCode	marker1	 marker2
   #       CPI282	      0.1	  0.3
   #       CPI270	      0.2	  0.3
   #       CPI515	      0.3	  0.6
   #       CPI280	      0.4	  0.4
   #       CPI248	      NA	     0.1
   
   if (keep_all_cols == FALSE){
      df <- subset(df, select = c(selected_marker, 'studyCode')) 
   }
   
   selected_marker_sym <- sym(selected_marker)
   
   if (asc == TRUE){
      df_sorted <- df %>% arrange(!!selected_marker_sym)
   } else {
      df_sorted <- df %>% arrange(desc(!!selected_marker_sym))
   }
   
   # Move selected_marker column to the second position
   df_sorted <- df_sorted %>%
                  select('studyCode', selected_marker, everything())
   
   return (df_sorted)
}

In [ ]:
df1 <- data.frame(studyCode = c('CPI515', 'CPI248', 'CPI270', 'CPI280', 'CPI282'),
                 marker1 = c(0.3, NA, 0.2, 0.4, 0.1), 
                 marker2 = c(0.6, 0.1, 0.3, 0.4, 0.3))
df1

In [ ]:
#df <- sort_a_marker(df=df, selected_marker='marker1', asc=TRUE, keep_all_cols=TRUE)
#df

In [ ]:
# Add gender to columm
dic = list(Male = c('CPI515', 'CPI270'),
           Female = c('CPI248', 'CPI282'),    
           Other = c('CPI280')) # c()) #
#dic
n <- c("Male", "Female", "Other")
#stack(setNames(dic, n))
#unlist(dic)
df2 <- data.frame(value = unlist(dic), key = rep(n, lengths(dic)))
df2

In [ ]:
df <- merge(x = df1,
                     y = df2,
                     by.x = 'studyCode',
                     by.y = 'value')
df

In [ ]:
df[order(df$key, df$marker1), ]

In [ ]:
# bind_rows(dic)

In [ ]:
as.data.frame(dic)

In [ ]:
as.data.frame(dic, col.names = c("Numbers", "Letters", "Words"))

# VI. Sort row names

In [ ]:
df <- data.frame(label = c('a1', 'a2', 'a3', 'a4', 'a5'),
                 x1 = c(9, 2, 3, NA, NA), 
                 x2 = c(100, NA, 300, 400, NA))
# Create index
row.names(df) <- df[['label']]
df

In [ ]:
dic = list('A'=c('a1', 'a4'),
            'Test' = c('a2', 'a3', 'a5')
          )
dic

## Order data frame rows according to vector with specific order  
https://stackoverflow.com/questions/11977102/order-data-frame-rows-according-to-vector-with-specific-order

In [ ]:
df <- data.frame(name = letters[1:4], value = c(rep(TRUE, 2), rep(FALSE, 2)))
df

In [ ]:
target <- c("b", "c", "a", "d")
target

In [ ]:
# match: It will work as long as your target contains exactly the same elements
#        as df$name, and neither contain duplicate values.
df[match(target, df$name),]

In [ ]:
# Left join
left_join(data.frame(name=target), df, by="name")

In [ ]:
library(dplyr)
df %>% arrange(factor(name, levels = target))

In [ ]:
# Or order it and use it in slice
df %>% slice(order(factor(name, levels = target)))

In [ ]:

target <- c("b", "c", "a", "d")
target
library(dplyr)
df %>% arrange(factor(name, levels = target))

In [ ]:
df <- data.frame(name = letters[1:4], value = c(rep(TRUE, 2), rep(FALSE, 2)))
row.names(df) <- df$name
df <- subset(df, select = -c(name))
df
#df %>% arrange(factor(index, levels = target))
target <- c("b", "c", "a", "d")
# df[match(target, df$rownames(df)),]
df$name <- row.names(df)
df

### https://stackoverflow.com/questions/26556191/order-a-dataframe-according-to-a-given-list-in-r

In [ ]:
DF <- 
read.csv(text=
'id,nobs
2,463
8,586
12,338
55,711
111,932')
DF

In [ ]:
# keys to use for sorting
keys <- c(2, 55, 8, 111, 12)
keys

In [ ]:
keyDF <- data.frame(key=keys, weight=1:length(keys))
keyDF

In [ ]:
merged <- merge(DF,
                keyDF,
                by.x='id',
                by.y='key',
                all.x=T,
                all.y=F)
merged

In [ ]:
res <- merged[order(merged$weight),c('id','nobs')]
res